; domain
(define (domain c-d-farmbot)

; this domain is tried with popf planner, simple and esterel parser and dispatchers
; esterel dispatcher will not work because some action wkll be dispatched concurrently rather than sequentially 
; use simple dispatcher
; the popf is unable to produce optimal plan on the first iteration. However, we can wait for it to iterate on the plan. but it takes time
(:requirements 
    :strips 
    ; :fluents ;bfws.py will fail if :fluents is enabled
    ; :durative-actions
    :typing 
    ; :timed-initial-literals 
    :conditional-effects 
    ; :negative-preconditions 
    ; :duration-inequalities 
    ; :equality 
    ; :disjunctive-preconditions
    ; :universal-preconditions
    ; :existential-preconditions

)

(:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
    
    position
    plant seed weed - object
    ;sucker sprayhead blade camera sensor container - tool
    tool
    toolrack
    level
    container ; seed container
    bin
    
)

; un-comment following line if constants are needed
;(:constants )

(:predicates ;todo: define predicates here
   ; (farmbot-functioning)
    (tool-mount-free)
    (farmbot-at ?x - position)
    (carry-tool ?t - tool)
    ; (visited ?x - position)
    (carry-camera)

    (tool-at ?x - position ?t - tool)
    (tool-rack-at ?tr - toolrack ?t - tool ?x - position)

    (no-plant-at ?x - position)
    (plant-at ?x - position ?p - plant)

    (checked-weed-exist ?x - position)
    (weed-at ?x - position)
    (weed-removed ?x - position)
    (no-weed-at ?x - position)
    

    (carry-seed ?s - seed)
    (seeder-free)

    (container-at ?x - position ?c - container)
    (container-has ?c - container ?s - seed)
    (match-seed-type-n-plant-type ?s - seed ?p - plant)

    (bin-at ?x - position ?b - bin)

    (checked-moisture ?x - position ?p - plant)
    (need-water ?x - position ?p - plant)
    (not-need-water ?x - position ?p - plant)
    (watered ?x - position ?p - plant)

    
)

(:constants
    low high - level
    seeder wateringnozzle weeder soilsensor - tool
    seedtray - container
    seedbin - bin
    seederrack wateringnozzlerack weederrack soilsensorrack - toolrack
    seederPos wateringnozzlePos weederPos soilsensorPos posSeedTray posBin - position
)


; (:functions
;     (remaining-seed ?c - container ?s - seed)
; )

(:action move
    :parameters (?x ?y - position)
    :precondition (and 
        (farmbot-at ?x)
        ;(farmbot-functioning)
    )
    :effect (and 
        (not (farmbot-at ?x))
        (farmbot-at ?y)
    )
)


(:action pick_up_tool
    :parameters (?x - position ?t - tool)
    :precondition (and 
    
        (tool-at ?x ?t)
        (tool-mount-free)
        (farmbot-at ?x)
        ;(farmbot-functioning)
  
    )
    :effect (and 
      
        (not (tool-mount-free))
        (not (tool-at ?x ?t))
        (carry-tool ?t)

    )
)

(:action put_down_tool
    :parameters (?x - position ?t - tool ?tr - toolrack)
    :precondition (and 
      
        (carry-tool ?t)
        (tool-rack-at ?tr ?t ?x)
        (farmbot-at ?x)
        ;(farmbot-functioning)

    )
    :effect (and 
    
        (not (carry-tool ?t)) 
        (tool-mount-free)
        (tool-at ?x ?t)

    )
)


(:action drop_seed
    :parameters (?x - position ?s - seed)
    :precondition (and 

        (bin-at ?x seedbin)
        (farmbot-at ?x)
        ;(farmbot-functioning)

    )
    :effect (and 

        (seeder-free)

    )
)


(:action pick_up_seed
    :parameters (?x - position ?s - seed ?c - container)
    :precondition (and 

        (container-has ?c ?s)
        (seeder-free)
        ; (> (remaining-seed ?c ?s) 0)
        (container-at ?x ?c)
        (farmbot-at ?x)
       ; (farmbot-functioning)
        (carry-tool seeder)
    )
    :effect (and 

        (not (seeder-free))
        (carry-seed ?s)
        (not (container-has ?c ?s))
        ; (decrease (remaining-seed ?c ?s) 1)
    )
)

(:action place_seed
    :parameters (?x - position ?s - seed ?p - plant)
    :precondition (and 
       
        (no-plant-at ?x)
        (carry-seed ?s)

        (farmbot-at ?x)
        (match-seed-type-n-plant-type ?s ?p)
       ; (farmbot-functioning)
        (carry-tool seeder)
 
    )
    :effect (and 

        (not (carry-seed ?s))
        (not (no-plant-at ?x))
        (seeder-free)

    
        (plant-at ?x ?p)      

    )
)

(:action check_need_water
    :parameters (?x - position ?p - plant)
    :precondition (and 

        (plant-at ?x ?p)
        (farmbot-at ?x)
        (carry-tool soilsensor)
      ;  (farmbot-functioning)

    )
    :effect (and 
 
        (checked-moisture ?x ?p)
        (not (watered ?x ?p)); this is very important to enable the APP to cycle between two state, otherwise the goal will already be satisfied the second time it comes back to water plan

    )

    ; update the KB in the actual action dispatch and feedback unit
    ; if the need-water predicate needs to be added, based on the result from the moisture sensor
)

(:action water_plant
    :parameters (?x - position ?p - plant)
    :precondition (and 
   
        (need-water ?x ?p)

        (farmbot-at ?x)
        (plant-at ?x ?p)
        (carry-tool wateringnozzle)
        ;(farmbot-functioning)
   
    )
    :effect (and 

        (not (need-water ?x ?p))
        (not (checked-moisture ?x ?p))

        (watered ?x ?p)
   
    )
)


(:action skip_water_plant
    :parameters (?x - position ?p - plant)

    :precondition (and 

        (not-need-water ?x ?p)

        (plant-at ?x ?p)
        ;(farmbot-functioning)
    

    )
    :effect (and 

        (not (not-need-water ?x ?p)) 
        (not (checked-moisture ?x ?p))

        (watered ?x ?p)

    )
)


(:action detect_weed
    :parameters (?x - position ?p - plant)
    :precondition (and 
        (carry-camera)
        (farmbot-at ?x)
        ;(farmbot-functioning)
        (tool-mount-free)
        (plant-at ?x ?p)
        
    )
    :effect (and 
        (not (weed-removed ?x))
        (checked-weed-exist ?x)
    )
)

(:action remove_weed 
    :parameters (?x - position) ; while updating the kb, we have to add the instance ?w - w1, w2, w3 etc.
    :precondition (and 
        (farmbot-at ?x)
       ; (farmbot-functioning)
        (carry-tool weeder)
        (weed-at ?x)
    )
    :effect (and 
        (weed-removed ?x)
        (not (weed-at ?x))
        (not (checked-weed-exist ?x))
    )
)

(:action skip_remove_weed
    :parameters (?x - position) ; while updating the kb, we have to add the instance ?w - w1, w2, w3 etc.
    :precondition (and 
        (farmbot-at ?x)
       ; (farmbot-functioning)
        (carry-tool weeder)
        (no-weed-at ?x)
    )
    :effect (and 
        (weed-removed ?x)
        (not (no-weed-at ?x))
        (not (checked-weed-exist ?x))
    )
)



)

; problem
(define (problem task)
(:domain c-d-farmbot)
(:objects
    home pos1 pos2 pos3 pos4 pos5 pos6 pos7 pos8 pos9 pos10 pos11 pos12 pos13 pos14 pos15 seederpos wateringnozzlepos weederpos soilsensorpos posseedtray posbin - position
    carrot - plant
    seed1 seed2 seed3 seed4 seed5 seed6 seed7 seed8 seed9 seed10 seed11 seed12 seed13 seed14 seed15 - seed
    seeder wateringnozzle weeder soilsensor - tool
    seederrack wateringnozzlerack weederrack soilsensorrack - toolrack
    low high - level
    seedtray - container
    seedbin - bin
)
(:init
    (tool-mount-free)

    (farmbot-at home)


    (carry-camera)

    (tool-at seederpos seeder)
    (tool-at wateringnozzlepos wateringnozzle)
    (tool-at weederpos weeder)
    (tool-at soilsensorpos soilsensor)

    (tool-rack-at seederrack seeder seederpos)
    (tool-rack-at wateringnozzlerack wateringnozzle wateringnozzlepos)
    (tool-rack-at weederrack weeder weederpos)
    (tool-rack-at soilsensorrack soilsensor soilsensorpos)

    (no-plant-at pos1)
    (no-plant-at pos2)
    (no-plant-at pos3)
    (no-plant-at pos4)
    (no-plant-at pos5)
    (no-plant-at pos6)
    (no-plant-at pos7)
    (no-plant-at pos8)
    (no-plant-at pos9)
    (no-plant-at pos10)
    (no-plant-at pos11)
    (no-plant-at pos12)
    (no-plant-at pos13)
    (no-plant-at pos14)
    (no-plant-at pos15)







    (seeder-free)

    (container-at posseedtray seedtray)

    (container-has seedtray seed1)
    (container-has seedtray seed2)
    (container-has seedtray seed3)
    (container-has seedtray seed4)
    (container-has seedtray seed5)
    (container-has seedtray seed6)
    (container-has seedtray seed7)
    (container-has seedtray seed8)
    (container-has seedtray seed9)
    (container-has seedtray seed10)
    (container-has seedtray seed11)
    (container-has seedtray seed12)
    (container-has seedtray seed13)
    (container-has seedtray seed14)
    (container-has seedtray seed15)

    (match-seed-type-n-plant-type seed1 carrot)
    (match-seed-type-n-plant-type seed2 carrot)
    (match-seed-type-n-plant-type seed3 carrot)
    (match-seed-type-n-plant-type seed4 carrot)
    (match-seed-type-n-plant-type seed5 carrot)
    (match-seed-type-n-plant-type seed6 carrot)
    (match-seed-type-n-plant-type seed7 carrot)
    (match-seed-type-n-plant-type seed8 carrot)
    (match-seed-type-n-plant-type seed9 carrot)
    (match-seed-type-n-plant-type seed10 carrot)
    (match-seed-type-n-plant-type seed11 carrot)
    (match-seed-type-n-plant-type seed12 carrot)
    (match-seed-type-n-plant-type seed13 carrot)
    (match-seed-type-n-plant-type seed14 carrot)
    (match-seed-type-n-plant-type seed15 carrot)

    (bin-at posbin seedbin)





)
(:goal (and
    (plant-at pos1 carrot)
    (plant-at pos2 carrot)
    (plant-at pos3 carrot)
    (plant-at pos4 carrot)
    (plant-at pos5 carrot)
    (plant-at pos6 carrot)
    (plant-at pos7 carrot)
    (plant-at pos8 carrot)
    (plant-at pos9 carrot)
    (plant-at pos10 carrot)
    (plant-at pos11 carrot)
    (plant-at pos12 carrot)
    (plant-at pos13 carrot)
    (plant-at pos14 carrot)
    (plant-at pos15 carrot)
))
)

; plan
1. (move home seederpos)
   deleted: (farmbot-at home)
   added: (farmbot-at seederpos)
   goals met: 0 of 15
2. (pick_up_tool seederpos seeder)
   deleted: (tool-mount-free) (tool-at seederpos seeder)
   added: (carry-tool seeder)
   goals met: 0 of 15
3. (move seederpos posseedtray)
   deleted: (farmbot-at seederpos)
   added: (farmbot-at posseedtray)
   goals met: 0 of 15
4. (pick_up_seed posseedtray seed7 seedtray)
   deleted: (seeder-free) (container-has seedtray seed7)
   added: (carry-seed seed7)
   goals met: 0 of 15
5. (move posseedtray pos15)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos15)
   goals met: 0 of 15
6. (place_seed pos15 seed7 carrot)
   deleted: (carry-seed seed7) (no-plant-at pos15)
   added: (seeder-free) (plant-at pos15 carrot)
   goals met: 1 of 15
7. (move pos15 posseedtray)
   deleted: (farmbot-at pos15)
   added: (farmbot-at posseedtray)
   goals met: 1 of 15
8. (pick_up_seed posseedtray seed12 seedtray)
   deleted: (seeder-free) (container-has seedtray seed12)
   added: (carry-seed seed12)
   goals met: 1 of 15
9. (move posseedtray pos14)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos14)
   goals met: 1 of 15
10. (place_seed pos14 seed12 carrot)
   deleted: (carry-seed seed12) (no-plant-at pos14)
   added: (seeder-free) (plant-at pos14 carrot)
   goals met: 2 of 15
11. (move pos14 posseedtray)
   deleted: (farmbot-at pos14)
   added: (farmbot-at posseedtray)
   goals met: 2 of 15
12. (pick_up_seed posseedtray seed6 seedtray)
   deleted: (seeder-free) (container-has seedtray seed6)
   added: (carry-seed seed6)
   goals met: 2 of 15
13. (move posseedtray pos13)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos13)
   goals met: 2 of 15
14. (place_seed pos13 seed6 carrot)
   deleted: (carry-seed seed6) (no-plant-at pos13)
   added: (seeder-free) (plant-at pos13 carrot)
   goals met: 3 of 15
15. (move pos13 posseedtray)
   deleted: (farmbot-at pos13)
   added: (farmbot-at posseedtray)
   goals met: 3 of 15
16. (pick_up_seed posseedtray seed9 seedtray)
   deleted: (seeder-free) (container-has seedtray seed9)
   added: (carry-seed seed9)
   goals met: 3 of 15
17. (move posseedtray pos12)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos12)
   goals met: 3 of 15
18. (place_seed pos12 seed9 carrot)
   deleted: (carry-seed seed9) (no-plant-at pos12)
   added: (seeder-free) (plant-at pos12 carrot)
   goals met: 4 of 15
19. (move pos12 posseedtray)
   deleted: (farmbot-at pos12)
   added: (farmbot-at posseedtray)
   goals met: 4 of 15
20. (pick_up_seed posseedtray seed14 seedtray)
   deleted: (seeder-free) (container-has seedtray seed14)
   added: (carry-seed seed14)
   goals met: 4 of 15
21. (move posseedtray pos11)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos11)
   goals met: 4 of 15
22. (place_seed pos11 seed14 carrot)
   deleted: (carry-seed seed14) (no-plant-at pos11)
   added: (seeder-free) (plant-at pos11 carrot)
   goals met: 5 of 15
23. (move pos11 posseedtray)
   deleted: (farmbot-at pos11)
   added: (farmbot-at posseedtray)
   goals met: 5 of 15
24. (pick_up_seed posseedtray seed11 seedtray)
   deleted: (seeder-free) (container-has seedtray seed11)
   added: (carry-seed seed11)
   goals met: 5 of 15
25. (move posseedtray pos10)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos10)
   goals met: 5 of 15
26. (place_seed pos10 seed11 carrot)
   deleted: (carry-seed seed11) (no-plant-at pos10)
   added: (seeder-free) (plant-at pos10 carrot)
   goals met: 6 of 15
27. (move pos10 posseedtray)
   deleted: (farmbot-at pos10)
   added: (farmbot-at posseedtray)
   goals met: 6 of 15
28. (pick_up_seed posseedtray seed5 seedtray)
   deleted: (seeder-free) (container-has seedtray seed5)
   added: (carry-seed seed5)
   goals met: 6 of 15
29. (move posseedtray pos9)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos9)
   goals met: 6 of 15
30. (place_seed pos9 seed5 carrot)
   deleted: (carry-seed seed5) (no-plant-at pos9)
   added: (seeder-free) (plant-at pos9 carrot)
   goals met: 7 of 15
31. (move pos9 posseedtray)
   deleted: (farmbot-at pos9)
   added: (farmbot-at posseedtray)
   goals met: 7 of 15
32. (pick_up_seed posseedtray seed4 seedtray)
   deleted: (seeder-free) (container-has seedtray seed4)
   added: (carry-seed seed4)
   goals met: 7 of 15
33. (move posseedtray pos8)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos8)
   goals met: 7 of 15
34. (place_seed pos8 seed4 carrot)
   deleted: (carry-seed seed4) (no-plant-at pos8)
   added: (seeder-free) (plant-at pos8 carrot)
   goals met: 8 of 15
35. (move pos8 posseedtray)
   deleted: (farmbot-at pos8)
   added: (farmbot-at posseedtray)
   goals met: 8 of 15
36. (pick_up_seed posseedtray seed13 seedtray)
   deleted: (seeder-free) (container-has seedtray seed13)
   added: (carry-seed seed13)
   goals met: 8 of 15
37. (move posseedtray pos7)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos7)
   goals met: 8 of 15
38. (place_seed pos7 seed13 carrot)
   deleted: (carry-seed seed13) (no-plant-at pos7)
   added: (seeder-free) (plant-at pos7 carrot)
   goals met: 9 of 15
39. (move pos7 posseedtray)
   deleted: (farmbot-at pos7)
   added: (farmbot-at posseedtray)
   goals met: 9 of 15
40. (pick_up_seed posseedtray seed3 seedtray)
   deleted: (seeder-free) (container-has seedtray seed3)
   added: (carry-seed seed3)
   goals met: 9 of 15
41. (move posseedtray pos6)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos6)
   goals met: 9 of 15
42. (place_seed pos6 seed3 carrot)
   deleted: (carry-seed seed3) (no-plant-at pos6)
   added: (seeder-free) (plant-at pos6 carrot)
   goals met: 10 of 15
43. (move pos6 posseedtray)
   deleted: (farmbot-at pos6)
   added: (farmbot-at posseedtray)
   goals met: 10 of 15
44. (pick_up_seed posseedtray seed8 seedtray)
   deleted: (seeder-free) (container-has seedtray seed8)
   added: (carry-seed seed8)
   goals met: 10 of 15
45. (move posseedtray pos5)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos5)
   goals met: 10 of 15
46. (place_seed pos5 seed8 carrot)
   deleted: (carry-seed seed8) (no-plant-at pos5)
   added: (seeder-free) (plant-at pos5 carrot)
   goals met: 11 of 15
47. (move pos5 posseedtray)
   deleted: (farmbot-at pos5)
   added: (farmbot-at posseedtray)
   goals met: 11 of 15
48. (pick_up_seed posseedtray seed10 seedtray)
   deleted: (seeder-free) (container-has seedtray seed10)
   added: (carry-seed seed10)
   goals met: 11 of 15
49. (move posseedtray pos4)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos4)
   goals met: 11 of 15
50. (place_seed pos4 seed10 carrot)
   deleted: (carry-seed seed10) (no-plant-at pos4)
   added: (seeder-free) (plant-at pos4 carrot)
   goals met: 12 of 15
51. (move pos4 posseedtray)
   deleted: (farmbot-at pos4)
   added: (farmbot-at posseedtray)
   goals met: 12 of 15
52. (pick_up_seed posseedtray seed2 seedtray)
   deleted: (seeder-free) (container-has seedtray seed2)
   added: (carry-seed seed2)
   goals met: 12 of 15
53. (move posseedtray pos3)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos3)
   goals met: 12 of 15
54. (place_seed pos3 seed2 carrot)
   deleted: (carry-seed seed2) (no-plant-at pos3)
   added: (seeder-free) (plant-at pos3 carrot)
   goals met: 13 of 15
55. (move pos3 posseedtray)
   deleted: (farmbot-at pos3)
   added: (farmbot-at posseedtray)
   goals met: 13 of 15
56. (pick_up_seed posseedtray seed1 seedtray)
   deleted: (seeder-free) (container-has seedtray seed1)
   added: (carry-seed seed1)
   goals met: 13 of 15
57. (move posseedtray pos2)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos2)
   goals met: 13 of 15
58. (place_seed pos2 seed1 carrot)
   deleted: (carry-seed seed1) (no-plant-at pos2)
   added: (seeder-free) (plant-at pos2 carrot)
   goals met: 14 of 15
59. (move pos2 posseedtray)
   deleted: (farmbot-at pos2)
   added: (farmbot-at posseedtray)
   goals met: 14 of 15
60. (pick_up_seed posseedtray seed15 seedtray)
   deleted: (seeder-free) (container-has seedtray seed15)
   added: (carry-seed seed15)
   goals met: 14 of 15
61. (move posseedtray pos1)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at pos1)
   goals met: 14 of 15
62. (place_seed pos1 seed15 carrot)
   deleted: (carry-seed seed15) (no-plant-at pos1)
   added: (seeder-free) (plant-at pos1 carrot)
   goals met: 15 of 15
